{
    "request_headers": {
        "A-IM": "Acceptable instance-manipulations for the request",
        "Accept": "Media type(s) that are acceptable for the response",
        "Accept-Charset": "Character sets that are acceptable",
        "Accept-Datetime": "Acceptable version in time",
        "Accept-Encoding": "List of acceptable encodings",
        "Accept-Language": "List of acceptable human languages for response",
        "Accept-Post": "Specifies which media types are accepted for POST requests",
        "Access-Control-Request-Headers": "Initiates a request for cross-origin resource sharing",
        "Access-Control-Request-Method": "Initiates a request for cross-origin resource sharing",
        "Alt-Used": "Identifies the alternative service in use, similar to Host header",
        "Attribution-Reporting-Eligible": "Indicates response is eligible to register an attribution source or trigger (Experimental)",
        "Authorization": "Authentication credentials for HTTP authentication",
        "Available-Dictionary": "Specifies the best matching dictionary for Compression Dictionary Transport (Experimental)",
        "Cache-Control": "Used to specify directives for caching mechanisms",
        "Connection": "Control options for the current connection",
        "Content-Digest": "Provides a digest of message content for integrity validation",
        "Content-DPR": "Indicates the device pixel ratio of the client (Non-standard, Deprecated)",
        "Content-Encoding": "The type of encoding used on the data",
        "Content-Length": "The length of the request body in octets",
        "Content-MD5": "A Base64-encoded binary MD5 sum of the content",
        "Content-Type": "The Media type of the body of the request",
        "Cookie": "Contains HTTP cookies previously sent by the server with Set-Cookie. Used to maintain session state and pass user preferences and/or information between requests.",
        "Critical-CH": "Identifies accepted client hints that are critical (Experimental)",
        "Date": "The date and time at which the message was originated",
        "Device-Memory": "Indicates approximate available RAM on client device in gigabytes",
        "Dictionary-ID": "References a dictionary for Compression Dictionary Transport (Experimental)",
        "DNT": "Indicates user's tracking preference (Non-standard, Deprecated)",
        "Downlink": "Indicates approximate bandwidth of client's connection in Mbps (Experimental)",
        "DPR": "Indicates client device pixel ratio (Non-standard, Deprecated)",
        "Early-Data": "Indicates request was conveyed in TLS early data (Experimental)",
        "ECT": "Indicates effective connection type (slow-2g, 2g, 3g, 4g) (Experimental)",
        "Expect": "Indicates expectations that need to be met by server",
        "Expect-CT": "Indicates that the client expects Certificate Transparency (Deprecated)",
        "Forwarded": "Disclose original information of a client",
        "From": "The email address of the user making the request",
        "Front-End-Https": "Non-standard header field used by Microsoft applications and load-balancers",
        "Host": "The domain name of the server and TCP port number",
        "HTTP2-Settings": "Parameters that govern the HTTP/2 connection",
        "If-Match": "Makes a request conditional. Server returns resources only if they match one of the ETag values",
        "If-Modified-Since": "Makes a request conditional. Server returns 200 with resource only if modified after the specified date",
        "If-None-Match": "Makes a request conditional. Server returns 200 with resource only if no ETag matches",
        "If-Range": "Makes a range request conditional. If condition met, returns 206 with partial content",
        "If-Unmodified-Since": "Makes a request conditional. Server processes request only if resource hasn't been modified since specified date",
        "Keep-Alive": "Hints how a connection may be used in terms of timeout and maximum requests",
        "Max-Forwards": "Used with TRACE to limit number of nodes (proxies) request goes through",
        "Origin": "Indicates the origin (scheme, hostname, port) that caused the request",
        "Permissions-Policy": "Controls which browser features can be used in document and iframes (Experimental)",
        "Pragma": "Implementation-specific fields",
        "Prefer": "Allows client to request certain behaviors",
        "Priority": "Indicates client's preference for response priority order",
        "Proxy-Authorization": "Authorization credentials for connecting to a proxy",
        "Proxy-Connection": "Implementation-specific header for proxy connections",
        "Range": "Request only part of an entity",
        "Referer": "The address of the previous web page",
        "Referrer-Policy": "Controls how much referrer information is included with requests",
        "RTT": "Indicates approximate round trip time on application layer in milliseconds (Experimental)",
        "Save-Data": "Indicates client's preference for reduced data usage (Experimental)",
        "Sec-Browsing-Topics": "Sends the selected topics for the current user along with the associated request",
        "Sec-CH-Prefers-Color-Scheme": "Media feature client hint providing the user's preference for light or dark color themes",
        "Sec-CH-Prefers-Reduced-Motion": "User agent client hint indicating preference for animations to be displayed with reduced motion",
        "Sec-CH-Prefers-Reduced-Transparency": "User agent client hint indicating preference for reduced transparency",
        "Sec-CH-UA": "User agent client hint providing the user-agent's branding and significant version information",
        "Sec-CH-UA-Arch": "User agent client hint containing the user-agent's underlying CPU architecture",
        "Sec-CH-UA-Bitness": "User agent client hint providing the 'bitness' of the user-agent's underlying CPU architecture",
        "Sec-CH-UA-Form-Factors": "User agent client hint providing information on the user-agent's device form factor",
        "Sec-CH-UA-Full-Version": "User agent client hint providing the user-agent's full version string (deprecated)",
        "Sec-CH-UA-Full-Version-List": "User agent client hint providing the user-agent's branding and full version information",
        "Sec-CH-UA-Mobile": "User agent client hint indicating whether the browser is on a mobile device",
        "Sec-CH-UA-Model": "User agent client hint indicating the device model on which the browser is running",
        "Sec-CH-UA-Platform": "User agent client hint providing the platform or operating system on which the user agent is running",
        "Sec-CH-UA-Platform-Version": "User agent client hint providing the version of the operating system",
        "Sec-CH-UA-WoW64": "User agent client hint indicating if a 32-bit user-agent application is running on a 64-bit Windows machine",
        "Sec-Fetch-Dest": "Fetch metadata request header indicating the request's destination",
        "Sec-Fetch-Mode": "Fetch metadata request header indicating the mode of the request",
        "Sec-Fetch-Site": "Fetch metadata request header indicating the relationship between request initiator's origin and requested resource",
        "Sec-Fetch-User": "Fetch metadata request header sent for requests initiated by user activation",
        "Sec-GPC": "The Sec-GPC (Global Privacy Control) request header indicates whether the user consents to a website or service selling or sharing their personal information",
        "Sec-Purpose": "Fetch metadata request header indicating the purpose for which the requested resource will be used",
        "Sec-WebSocket-Extensions": "Used in WebSocket opening handshake to negotiate protocol extensions",
        "Sec-WebSocket-Key": "Used in WebSocket opening handshake to confirm client's intent to upgrade to WebSocket",
        "Sec-WebSocket-Protocol": "Used in WebSocket opening handshake to negotiate sub-protocols",
        "Sec-WebSocket-Version": "Used in WebSocket opening handshake to indicate supported protocol versions",
        "TE": "The transfer encodings the user agent is willing to accept",
        "Trailer": "Indicates header fields present in the trailer",
        "Transfer-Encoding": "The form of encoding used to transfer the entity",
        "Upgrade": "Ask the server to upgrade to another protocol",
        "User-Agent": "The user agent string of the user agent",
        "Via": "Informs the server of proxies through which the request was sent",
        "Warning": "A general warning about possible problems",
        "Width": "Device client hint indicating the desired resource width in physical pixels",
        "X-Correlation-ID": "Correlates HTTP requests between a client and server",
        "X-DNS-Prefetch-Control": "Controls DNS prefetching, a feature by which browsers proactively perform domain name resolution",
        "X-Forwarded-For": "Identifies the originating IP address of a client connecting through a proxy server",
        "X-Forwarded-Host": "Identifies the original host requested by the client",
        "X-Forwarded-Proto": "Identifies the protocol (HTTP or HTTPS) that a client used to connect to a proxy",
        "X-Http-Method-Override": "Requests a web application to override the method specified in the request",
        "X-Permitted-Cross-Domain-Policies": "Defines a meta-policy controlling whether site resources can be accessed cross-origin",
        "X-Robots-Tag": "Defines how crawlers should index URLs",
        "Upgrade-Insecure-Requests": "Sends a signal to the server indicating the client's preference for an encrypted and authenticated response, and that the client can successfully handle the upgrade-insecure-requests CSP directive. This header is widely available and supported by modern browsers."
    },
    "response_headers": {
        "Accept-CH": "Specifies which client hint headers should be included in subsequent requests. Client hints provide information about the client's device, network, and preferences. Common hints include: Device-Memory (RAM), DPR (device pixel ratio), Viewport-Width, Width, Save-Data (data saving preference), and Sec-CH-UA (user agent information).",
        "Accept-Patch": "Specifies which patch document formats are supported",
        "Accept-Ranges": "What partial content range types are supported",
        "Access-Control-Allow-Credentials": "Indicates whether credentials can be exposed",
        "Access-Control-Allow-Headers": "Indicates which headers can be used",
        "Access-Control-Allow-Methods": "Specifies the methods allowed",
        "Access-Control-Allow-Origin": "Specifies which web sites can participate in CORS",
        "Access-Control-Expose-Headers": "Indicates which headers can be exposed",
        "Access-Control-Max-Age": "Indicates how long preflight results can be cached",
        "Age": "The age the object has been in a proxy cache",
        "Allow": "Valid methods for a specified resource",
        "Alt-Svc": "Alternative services available",
        "Attribution-Reporting-Register-Source": "Registers a page feature as an attribution source (Experimental)",
        "Attribution-Reporting-Register-Trigger": "Registers a page feature as an attribution trigger (Experimental)",
        "Cache-Control": "Tells caching mechanisms whether they may cache",
        "Clear-Site-Data": "Clears browsing data (cookies, storage, cache) for the requesting website",
        "Connection": "Control options for the current connection",
        "Content-Disposition": "An opportunity to raise a 'File Download' dialogue",
        "Content-Encoding": "The type of encoding used on the data",
        "Content-Language": "The natural language of the intended audience",
        "Content-Length": "The length of the response body in octets",
        "Content-Location": "An alternate location for the returned data",
        "Content-MD5": "A Base64-encoded binary MD5 sum of the content",
        "Content-Range": "Where in a full body message this partial message belongs",
        "Content-Security-Policy": "Controls resources the user agent can load for a page. Directives: default-src (fallback for all fetch directives), script-src (JavaScript sources including eval(), inline scripts, and WebAssembly), style-src (stylesheet sources including inline styles), img-src (image and favicon sources), connect-src (URLs for XMLHttpRequest, WebSocket, and EventSource), font-src (font sources for @font-face), object-src (plugin sources for <object>, <embed>, and <applet>), media-src (media sources for <audio>, <video>, and <track>), frame-src (frame sources for <frame> and <iframe>), child-src (sources for web workers and nested browsing contexts), worker-src (sources for Worker, SharedWorker, and ServiceWorker), manifest-src (sources for application manifest files), base-uri (restricts URLs in <base> elements), form-action (restricts form submission URLs), frame-ancestors (specifies valid parent frames), sandbox (enables sandbox with optional restrictions), report-uri (sends violation reports), report-to (sends violation reports to specified endpoint), upgrade-insecure-requests (upgrades HTTP to HTTPS). Sources can include: 'self' (same origin), 'none' (block all), 'unsafe-inline' (allow inline resources), 'unsafe-eval' (allow dynamic code evaluation), 'wasm-unsafe-eval' (allow WebAssembly), 'strict-dynamic' (trust dynamic scripts), blob: (allow blob URLs), data: (allow data URLs), and specific domains.",
        "Content-Security-Policy-Report-Only": "Allows web developers to experiment with policies by monitoring their effects",
        "Content-Type": "The MIME type of this content",
        "Cross-Origin-Embedder-Policy": "Configures the document's policy for loading and embedding cross-origin resources. Requires CORP or CORS headers for cross-site resources, or allows loading with stripped credentials. Applies to loaded resources, iframes, and nested frames.",
        "Cross-Origin-Opener-Policy": "Controls whether new documents share the same browsing context group (BCG). Options: unsafe-none (default, permits sharing), same-origin (isolates to same-origin only), same-origin-allow-popups (allows popups with unsafe-none), noopener-allow-popups (isolates but allows popups). Prevents XS-Leaks by severing references between documents.",
        "Cross-Origin-Resource-Policy": "Indicates that the browser should block no-cors cross-origin/cross-site requests to the resource. Specifies which sites/origins are allowed to load the resource.",
        "Date": "The date and time that the message was sent",
        "Delta-Base": "Specifies the delta-encoding entity tag of the response",
        "ETag": "An identifier for a specific version of a resource",
        "Expires": "Gives the date/time after which the response is considered stale",
        "IM": "Instance-manipulations applied to the response",
        "Last-Modified": "Contains date/time when resource was last modified",
        "Link": "Serializes one or more links in HTTP headers",
        "Location": "Indicates what URL to redirect to",
        "NEL": "Configures network request logging (Experimental)",
        "No-Vary-Search": "Specifies rules for how URL query parameters affect cache matching (Experimental)",
        "Observe-Browsing-Topics": "Marks topics of interest inferred from calling site's URL (Experimental)",
        "Origin-Agent-Cluster": "Requests that document be placed in origin-keyed agent cluster",
        "P3P": "This header is supposed to set P3P policy",
        "Pragma": "Implementation-specific headers that may have various effects",
        "Preference-Applied": "Indicates which preferences were applied",
        "Proxy-Authenticate": "Request authentication to access the proxy",
        "Public-Key-Pins": "HTTP Public Key Pinning, announces hash of website's authentic TLS certificate",
        "Refresh": "Directs browser to refresh or redirect page after specified time",
        "Report-To": "Defines named groups of endpoints for warning and error reports (Non-standard, Deprecated)",
        "Reporting-Endpoints": "Specifies endpoints for sending reports generated by Reporting API",
        "Repr-Digest": "Provides digest of selected representation of target resource",
        "Retry-After": "If an entity is temporarily unavailable, this instructs the client to try again",
        "Sec-WebSocket-Accept": "Used in WebSocket opening handshake to indicate server's willingness to upgrade to WebSocket connection",
        "Sec-Speculation-Tags": "Contains tag values from speculation rules that resulted in the speculation",
        "Server": "Describes the software used by the origin server.",
        "Server-Timing": "Communicates performance metrics about the request-response cycle",
        "Service-Worker": "Included in fetches for a service worker's script resource",
        "Service-Worker-Allowed": "Used to broaden the path restriction for a service worker's default scope",
        "Service-Worker-Navigation-Preload": "Indicates request was from service worker navigation preloading",
        "Set-Cookie": "Sends a cookie from the server to the user agent. Multiple Set-Cookie headers can be sent in the same response to set multiple cookies. Attributes: Domain (host to send cookie to), Expires (cookie lifetime as HTTP-date), HttpOnly (prevents JavaScript access but can still be accessed by the server), Max-Age (seconds until expiration), Path (URL path requirement), SameSite (controls cross-site sending: Strict/Lax/None), Secure (HTTPS-only transmission).",
        "Set-Login": "Sent by federated identity provider to set its login status",
        "SourceMap": "Provides the location of a source map for the resource",
        "Speculation-Rules": "Provides URLs pointing to text resources containing speculation rule JSON definitions",
        "Strict-Transport-Security": "A HSTS Policy informing the HTTP client how long to cache the HTTPS only policy",
        "Supports-Loading-Mode": "Allows a response to opt-in to being loaded in a novel, higher-risk context",
        "TE": "The transfer encodings the user agent is willing to accept",
        "Timing-Allow-Origin": "Specifies origins allowed to see values of attributes retrieved via Resource Timing API",
        "Tk": "Tracking Status header, value suggested to be sent in response to a DNT(do-not-track)",
        "Trailer": "The Trailer general field value indicates that the given set of header fields is present in the trailer of a message encoded with chunked transfer coding",
        "Transfer-Encoding": "The form of encoding used to safely transfer the entity to the user",
        "Upgrade": "Ask the client to upgrade to another protocol",
        "Use-As-Dictionary": "Lists matching criteria for Compression Dictionary Transport dictionary",
        "Vary": "Tells downstream proxies how to match future request headers to decide whether the cached response can be used",
        "Via": "Informs the client of proxies through which the response was sent",
        "Viewport-Width": "Device client hint providing the client's layout viewport width in CSS pixels",
        "Warning": "A general warning about possible problems with the entity body",
        "Want-Content-Digest": "Indicates preference for recipient to send Content-Digest integrity header",
        "Want-Repr-Digest": "Indicates preference for recipient to send Repr-Digest integrity header",
        "WWW-Authenticate": "Indicates the authentication scheme that should be used to access the requested entity",
        "X-Content-Security-Policy": " is an older, experimental HTTP header that served as a precursor to the standard Content-Security-Policy header. Controls resources the user agent can load for a page. Directives: default-src (fallback for all fetch directives), script-src (JavaScript sources including eval(), inline scripts, and WebAssembly), style-src (stylesheet sources including inline styles), img-src (image and favicon sources), connect-src (URLs for XMLHttpRequest, WebSocket, and EventSource), font-src (font sources for @font-face), object-src (plugin sources for <object>, <embed>, and <applet>), media-src (media sources for <audio>, <video>, and <track>), frame-src (frame sources for <frame> and <iframe>), child-src (sources for web workers and nested browsing contexts), worker-src (sources for Worker, SharedWorker, and ServiceWorker), manifest-src (sources for application manifest files), base-uri (restricts URLs in <base> elements), form-action (restricts form submission URLs), frame-ancestors (specifies valid parent frames), sandbox (enables sandbox with optional restrictions), report-uri (sends violation reports), report-to (sends violation reports to specified endpoint), upgrade-insecure-requests (upgrades HTTP to HTTPS). Sources can include: 'self' (same origin), 'none' (block all), 'unsafe-inline' (allow inline resources), 'unsafe-eval' (allow dynamic code evaluation), 'wasm-unsafe-eval' (allow WebAssembly), 'strict-dynamic' (trust dynamic scripts), blob: (allow blob URLs), data: (allow data URLs), and specific domains.",
        "X-Content-Type-Options": "The only defined value, 'nosniff', prevents Internet Explorer from MIME-sniffing a response away from the declared content-type",
        "X-Frame-Options": "Controls whether a page can be rendered in a frame, iframe, embed or object. Used to prevent clickjacking attacks.",
        "X-Powered-By": "Specifies the technology (e.g. ASP.NET, PHP, JBoss) supporting the web application",
        "X-UA-Compatible": "Recommends the preferred rendering engine to use to display the content",
        "X-XSS-Protection": "Deprecated header that enabled XSS filtering in older browsers. Options: 0 (disable), 1 (enable), 1;mode=block (block page), 1;report=URI (report violations). Note: This header is deprecated and can create XSS vulnerabilities. Content-Security-Policy is the modern day replacement."
    }
}